DessertHunter/antFGM/Keil µVision5/nRF51422/Application/main.c
//!
//! Copyright 2016 DessertHunter
//!
/* Copyright (c) 2013 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */

#define ENABLE_BLE_SRV_HRS  0 ///< BLE Heart Rate Service
#define ENABLE_BLE_SRV_GLS  0 ///< BLE Glucose Service
#define ENABLE_BLE_SRV_BAS  0 ///< BLE Battery Service

/** @file
 *
 * @defgroup ble_sdk_app_ant_hrs_main main.c
 * @{
 * @ingroup ble_sdk_app_ant_hrs
 * @brief HRM sample application using both BLE and ANT.
 *
 * The application uses the BLE Heart Rate Service (and also the Device Information
 * services), and the ANT HRM RX profile.
 *
 * It will open a receive channel which will connect to an ANT HRM TX profile device when the
 * application starts. The received data will be propagated to a BLE central through the
 * BLE Heart Rate Service.
 *
 * The ANT HRM TX profile device simulator SDK application
 * (Board\pca10003\ant\ant_hrm\hrm_tx_buttons) can be used as a peer ANT device. By changing
 * ANT_HRMRX_NETWORK_KEY to the ANT+ Network Key, the application will instead be able to connect to
 * an ANT heart rate belt.
 *
 * @note The ANT+ Network Key is available for ANT+ Adopters. Please refer to
 *       http://thisisant.com to become an ANT+ Adopter and access the key.
 *
 * @note This application is based on the BLE Heart Rate Service Sample Application
 *       (Board\nrf6310\ble\ble_app_hrs). Please refer to this application for additional
 *       documentation.
 */

#include <stdint.h>
#include <string.h>
#include "nordic_common.h"
#include "nrf.h"
#include "app_error.h"
#include "nrf_delay.h"
#include "nrf_gpio.h"
#include "nrf_log.h"
#include "nrf.h"
#include "ble.h"
#include "ble_hci.h"
#include "ble_srv_common.h"
#include "ble_advdata.h"
#if (ENABLE_BLE_SRV_HRS == 1)
#include "ble_hrs.h"
#endif // ENABLE_BLE_SRV_HRS
#if (ENABLE_BLE_SRV_GLS == 1)
#include "ble_gls.h"
#include "ble_racp.h"
#endif // ENABLE_BLE_SRV_GLS
#if (ENABLE_BLE_SRV_BAS == 1)
#include "ble_bas.h"
#endif // ENABLE_BLE_SRV_BAS
#include "ble_dis.h"
#include "ble_conn_params.h"
#include "boards.h"
#include "sensorsim.h"
#include "softdevice_handler.h"
#include "app_timer.h"
#include "device_manager.h"
#include "ant_parameters.h"
#include "ant_interface.h"
#include "pstorage.h"
#include "app_trace.h"
#include "app_util.h"
#include "app_scheduler.h"
#include "bsp.h"
#include "ant_error.h"
#include "ant_stack_config.h"
#include "ant_key_manager.h"
#include "ant_state_indicator.h"
#include "SEGGER_RTT.h"
#include "main_Secret.h"


#define CR95HF_IS_ATTACHED              1
#define CR95HF_SLEEP_ENABLED            1

#define ENABLE_BATTERY_MEASURE          1 ///< ADC battery measurement
#define ENABLE_BATTERY_MEASURE_SDK10    1 ///< ADC battery measurement SDK v10
#define ENABLE_BATTERY_MEASURE_SDK11    0 ///< ADC battery measurement SDK v11


#if (ENABLE_BATTERY_MEASURE == 1)
#include "nrf_adc.h"

#define BATTERY_LEVEL_MEAS_INTERVAL     APP_TIMER_TICKS(2000, APP_TIMER_PRESCALER) /**< Battery level measurement interval (ticks). */
APP_TIMER_DEF(m_battery_timer_id);

static void battery_level_update(void);
static void battery_level_meas_timeout_handler(void * p_context);
void adc_sample(void);
static uint8_t m_battery_level_percent = 0; /**< Battery level in percent (0-100%) */

#if (ENABLE_BATTERY_MEASURE_SDK10 == 1)
#define ADC_RESOLUTION              ADC_CONFIG_RES_10bit         // Calibration is only performed for 10-bit ADC resolution
#endif // ENABLE_BATTERY_MEASURE_SDK10


#if (ENABLE_BATTERY_MEASURE_SDK11 == 1)
static void adc_event_handler(nrf_drv_adc_evt_t const * p_event);

#define ADC_BUFFER_SIZE                 6 /**< Size of buffer for ADC samples. */
static nrf_adc_value_t adc_buffer[ADC_BUFFER_SIZE]; /**< ADC buffer. */
static uint8_t adc_event_counter = 0;

#define ADC_REF_VOLTAGE_IN_MILLIVOLTS   1200
#define ADC_PRE_SCALING_COMPENSATION    3 
#define DIODE_FWD_VOLT_DROP_MILLIVOLTS  270
#define ADC_RESULT_IN_MILLI_VOLTS(ADC_VALUE)\
                                 ((((ADC_VALUE) * ADC_REF_VOLTAGE_IN_MILLIVOLTS) / 1023) * ADC_PRE_SCALING_COMPENSATION)
#endif // ENABLE_BATTERY_MEASURE_SDK11
#endif // ENABLE_BATTERY_MEASURE


#if (CR95HF_IS_ATTACHED == 1)
#include "CR95HF.h"
#define CR95HF_DEFAULT_TIMEOUT_MS       1000
#define CR95HF_READ_MAX_RETRY_CNT       3
#define CR95HF_BSP_USER_STATE           BSP_INDICATE_USER_STATE_1   // Gruene LED
#endif // CR95HF_IS_ATTACHED

#include "LibreSensor.h"


#define APP_SCHED_MAX_EVT_SIZE          5
#define APP_SCHED_QUEUE_SIZE            5

#define ANT_FGM_APP_VERSION             102  /**< Application Version (Major=VERSION / 100; Minor=VERSION % 100) */
#define STR_HELPER(x) #x
#define STR(x) STR_HELPER(x)


#define ENABLE_ANT_FGM                  1
#if (ENABLE_ANT_FGM == 1)
#include "ANT_FGM.h"
#endif // ENABLE_ANT_FGM


#define WAKEUP_BUTTON_ID                0                                            /**< Button used to wake up the application. */
#define BOND_DELETE_ALL_BUTTON_ID       1                                            /**< Button used for deleting all bonded centrals during startup. */


#define DEVICE_NAME                     "antFGM (V" STR(ANT_FGM_APP_VERSION) ")"     /**< Name of device. Will be included in the advertising data. */
#define MANUFACTURER_NAME               "DessertHunter@GitHub"                       /**< Manufacturer. Will be passed to Device Information Service. */
#define APP_ADV_INTERVAL                40                                           /**< The advertising interval (in units of 0.625 ms. This value corresponds to 25 ms). */
#define APP_ADV_TIMEOUT_IN_SECONDS      180                                          /**< The advertising timeout in units of seconds. */

