DessertHunter/antFGM/Keil µVision5/nRF51422/Application/main.c
#define IS_SRVC_CHANGED_CHARACT_PRESENT 0                                            /**< Whether or not to include the service_changed characteristic. If not enabled, the server's database cannot be changed for the lifetime of the device */
#define APP_TIMER_PRESCALER             0                                            /**< Value of the RTC1 PRESCALER register. */
#define APP_TIMER_OP_QUEUE_SIZE         4                                            /**< Size of timer operation queues. */

#define SECOND_1_25_MS_UNITS            800                                          /**< Definition of 1 second, when 1 unit is 1.25 ms. */
#define SECOND_10_MS_UNITS              100                                          /**< Definition of 1 second, when 1 unit is 10 ms. */
#define MIN_CONN_INTERVAL               (SECOND_1_25_MS_UNITS / 2)                   /**< Minimum acceptable connection interval (0.5 seconds), Connection interval uses 1.25 ms units. */
#define MAX_CONN_INTERVAL               (SECOND_1_25_MS_UNITS)                       /**< Maximum acceptable connection interval (1 second), Connection interval uses 1.25 ms units. */
#define SLAVE_LATENCY                   0                                            /**< Slave latency. */
#define CONN_SUP_TIMEOUT                (4 * SECOND_10_MS_UNITS)                     /**< Connection supervisory timeout (4 seconds), Supervision Timeout uses 10 ms units. */

#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(5000, APP_TIMER_PRESCALER)   /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(30000, APP_TIMER_PRESCALER)  /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3                                            /**< Number of attempts before giving up the connection parameter negotiation. */

#define SEC_PARAM_TIMEOUT               30                                           /**< Timeout for Pairing Request or Security Request (in seconds). */
#define SEC_PARAM_BOND                  1                                            /**< Perform bonding. */
#define SEC_PARAM_MITM                  0                                            /**< Man In The Middle protection not required. */
#define SEC_PARAM_IO_CAPABILITIES       BLE_GAP_IO_CAPS_NONE                         /**< No I/O capabilities. */
#define SEC_PARAM_OOB                   0                                            /**< Out Of Band data not available. */
#define SEC_PARAM_MIN_KEY_SIZE          7                                            /**< Minimum encryption key size. */
#define SEC_PARAM_MAX_KEY_SIZE          16                                           /**< Maximum encryption key size. */

#define DEAD_BEEF                       0xDEADBEEF                                   /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */


#if (ENABLE_ANT_FGM == 1)
#define FGM_CHANNEL_NUMBER       0x00    /**< Channel number assigned to FGM profile. */
#define FGM_DEVICE_NUMBER        123u    /**< Denotes the used ANT device number. 1 � 65535 (0 for searching) Set the Device Number parameter to zero to allow wildcard matching. Once the device number is learned, the receiving device should remember the number for future searches. */
//      FGM_DEVICE_TYPE          99u     /**< Selbst festgelegt */
#define FGM_TRANSMISSION_TYPE    1u      /**< Denotes the used ANT transmission type. */
// #define FGM_MSG_PERIOD_4Hz    0x1F86u ///< Default Message period, decimal 8070 (4.06 Hz).
#define FGM_NETWORK_NUMBER       0u      /**< Default Network Number */
#define FGM_ANTPUBLIC_RF_FREQ    60u     /**<*Provisory* ANT FGM RF Freq 2460 MHz */

#define FGM_MFG_ID               255u    /**< Manufacturer ID. he value 255 (0x00FF) has been reserved as a development ID and may be used by manufacturers that have not yet been assigned a value. */
#define FGM_SERIAL_NUMBER        0xFFFFu /**< Serial Number. */
#define FGM_HW_VERSION           5u      /**< HW Version. */
#define FGM_SW_VERSION           ANT_FGM_APP_VERSION   /**< SW Version. */
#define FGM_MODEL_NUMBER         2u      /**< Model Number. */

#endif // ENABLE_ANT_FGM


#if (ENABLE_ANT_FGM == 1)
/** @snippet [ANT FGM TX Instance] */
void ant_fgm_evt_handler(ant_fgm_profile_t * p_profile, ant_fgm_evt_t event);

FGM_SENS_CHANNEL_CONFIG_DEF(m_ant_fgm,
                            FGM_CHANNEL_NUMBER,
                            FGM_TRANSMISSION_TYPE,
                            FGM_DEVICE_NUMBER,
                            FGM_NETWORK_NUMBER);
FGM_SENS_PROFILE_CONFIG_DEF(m_ant_fgm,
                            true, // PAGE_1_PRESENT
                            ANT_FGM_PAGE_0,
                            ant_fgm_evt_handler);

static ant_fgm_profile_t m_ant_fgm;
/** @snippet [ANT FGM TX Instance] */
#endif // ENABLE_ANT_FGM


static uint16_t               m_conn_handle = BLE_CONN_HANDLE_INVALID;     /**< Handle of the current connection. */
static ble_gap_adv_params_t   m_adv_params;                                /**< Parameters to be passed to the stack when starting advertising. */

#if (ENABLE_BLE_SRV_HRS == 1)
static ble_hrs_t              m_hrs;                                       /**< Structure used to identify the heart rate service. */
#endif // ENABLE_BLE_SRV_HRS

#if (ENABLE_BLE_SRV_GLS == 1)
static ble_gls_t              m_gls;                                      /**< Structure used to identify the glucose service. */
#endif // ENABLE_BLE_SRV_GLS

static uint8_t                m_ant_network_key[] = ANT_PUBLIC_NETWORK_KEY; /**< ANT Public network key. */

#ifdef BONDING_ENABLE
static dm_application_instance_t        m_app_handle;                                /**< Application identifier allocated by device manager */
static bool                             m_app_initialized   = false;                 /**< Application initialized flag. */
#endif // BONDING_ENABLE

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
  bsp_indication_set(BSP_INDICATE_FATAL_ERROR);
  app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Start advertising.
 */
static void ble_advertising_start(void)
{
  uint32_t err_code;

  err_code = sd_ble_gap_adv_start(&m_adv_params);
  if (err_code != NRF_SUCCESS && err_code != NRF_ERROR_INVALID_STATE)
  {
    APP_ERROR_HANDLER(err_code);
  }

  err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
  APP_ERROR_CHECK(err_code);
}


#if (ENABLE_ANT_FGM == 1)
/**@brief Function for handling ANT FGM events.
 */
/** @snippet [ANT FGM simulator call] */
void ant_fgm_evt_handler(ant_fgm_profile_t * p_profile, ant_fgm_evt_t event)
{
    switch (event)
    {
        case ANT_FGM_PAGE_0_UPDATED:
            /* fall through */
        case ANT_FGM_PAGE_1_UPDATED:
            /* fall through */
        case ANT_FGM_PAGE_2_UPDATED:
            /* fall through */
        case ANT_FGM_PAGE_3_UPDATED:
            /* fall through */
        case ANT_FGM_PAGE_4_UPDATED:
          // TODO: ant_fgm_simulator_one_iteration(&m_ant_fgm_simulator);
            break;

        default:
            break;
    }
}
#endif // ENABLE_ANT_FGM


