DessertHunter/antFGM/Keil µVision5/nRF51422/Application/main.c
    // Initialize Device Information Service
    memset(&dis_init, 0, sizeof(dis_init));

    ble_srv_ascii_to_utf8(&dis_init.manufact_name_str, MANUFACTURER_NAME);

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&dis_init.dis_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&dis_init.dis_attr_md.write_perm);

    err_code = ble_dis_init(&dis_init);
    APP_ERROR_CHECK(err_code);
}

#if (ENABLE_BLE_SRV_HRS == 1)
/**@brief Connection Parameters Module handler.
 *
 * @details This function will be called for all events in the Connection Parameters Module which
 *          are passed to the application.
 *          @note All this function does is to disconnect. This could have been done by simply
 *                setting the disconnect_on_fail config parameter, but instead we use the event
 *                handler mechanism to demonstrate its use.
 *
 * @param[in]   p_evt   Event received from the Connection Parameters Module.
 */
static void ble_hrm_on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

    switch (p_evt->evt_type)
    {
        case BLE_CONN_PARAMS_EVT_FAILED:
            err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
            APP_ERROR_CHECK(err_code);
            break;

        default:
            // No implementation needed.
            break;
    }
}

/**@brief Connection Parameters module error handler.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void ble_hrm_conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

/**@brief Initialize the Connection Parameters module.
 */
static void ble_hrm_conn_params_init(void)
{
    uint32_t               err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = m_hrs.hrm_handles.cccd_handle;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = ble_hrm_on_conn_params_evt;
    cp_init.error_handler                  = ble_hrm_conn_params_error_handler;

    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}
#endif // ENABLE_BLE_SRV_HRS

#if (ENABLE_BLE_SRV_GLS == 1)
/**@brief Function for initializing the Connection Parameters module.
 */
static void ble_gls_conn_params_init(void)
{
    uint32_t               err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAM_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = ble_conn_params_error_handler;

    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}
#endif // ENABLE_BLE_SRV_GLS


/**@brief Function for dispatching a ANT stack event to all modules with a ANT stack event handler.
 *
 * @details This function is called from the ANT Stack event interrupt handler after a ANT stack
 *          event has been received.
 *
 * @param[in] p_ant_evt  ANT stack event.
 */
void ant_evt_dispatch(ant_evt_t * p_ant_evt)
{
#if (ENABLE_ANT_FGM == 1)
    ant_fgm_sens_evt_handler(&m_ant_fgm, p_ant_evt);
#endif // ENABLE_ANT_FGM
    ant_state_indicator_evt_handler(p_ant_evt);
}

/**
 * @brief Function for ANT stack initialization.
 *
 * @details Initializes the SoftDevice and the ANT event interrupt.
 */
static void softdevice_setup(void)
{
    uint32_t err_code;

    // TODO: Bereits gemacht! err_code = softdevice_ant_evt_handler_set(ant_evt_dispatch);
    // TODO: Bereits gemacht!     APP_ERROR_CHECK(err_code);

    // TODO: err_code = softdevice_handler_init(NRF_CLOCK_LFCLKSRC, NULL, 0, NULL);
    // TODO: APP_ERROR_CHECK(err_code);

    err_code = ant_stack_static_config(); // set ant resource
    APP_ERROR_CHECK(err_code);

    //err_code = ant_plus_key_set(ANTPLUS_NETWORK_NUMBER);
    err_code = sd_ant_network_address_set(FGM_NETWORK_NUMBER, m_ant_network_key);
    APP_ERROR_CHECK(err_code);
}

#if (ENABLE_BLE_SRV_HRS == 1)
static void ble_hrs_update_heart_rate(const uint16_t computed_heart_rate)
{
   uint32_t err_code;

  // TODO: R-R interval
  // TODO: ble_hrs_rr_interval_add(&m_hrs, beat_time - prev_beat);

  // Notify the received heart rate measurement
  err_code = ble_hrs_heart_rate_measurement_send(&m_hrs, computed_heart_rate);
  if (
      (err_code != NRF_SUCCESS)
      &&
      (err_code != NRF_ERROR_INVALID_STATE)
      &&
      (err_code != BLE_ERROR_NO_TX_BUFFERS)
      &&
      (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
  )
  {
      APP_ERROR_HANDLER(err_code);
  }
}
#endif // ENABLE_BLE_SRV_HRS


/**@brief Application's Stack BLE event handler.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 */
static void on_ble_evt(ble_evt_t * p_ble_evt)
{
    uint32_t err_code = NRF_SUCCESS;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
            APP_ERROR_CHECK(err_code);
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            err_code = bsp_indication_set(BSP_INDICATE_IDLE);
            APP_ERROR_CHECK(err_code);

            // Need to close the ANT channel to make it safe to write bonding information to flash
        // TODO: err_code = sd_ant_channel_close(ANT_HRMRX_ANT_CHANNEL);
        // TODO: APP_ERROR_CHECK(err_code);

