DessertHunter/antFGM/Keil µVision5/nRF51422/Application/main.c
#ifdef BONDING_ENABLE
    // Register with the SoftDevice handler module for BLE events.
    err_code = softdevice_sys_evt_handler_set(sys_evt_dispatch);
    APP_ERROR_CHECK(err_code);
#endif // BONDING_ENABLE
}


/** @snippet [ANT HRM simulator call] */

/**
 * @brief Function for HRM profile initialization.
 *
 * @details Initializes the HRM profile and open ANT channel.
 */
static void profile_setup(void)
{
  uint32_t err_code;

#if (ENABLE_ANT_FGM == 1)
/** @snippet [ANT FGM Profile Setup] */
  err_code = ant_fgm_sens_init(&m_ant_fgm,
                               FGM_SENS_CHANNEL_CONFIG(m_ant_fgm),
                               FGM_SENS_PROFILE_CONFIG(m_ant_fgm));
  APP_ERROR_CHECK(err_code);

  m_ant_fgm.FGM_PROFILE_manuf_id   = FGM_MFG_ID;
  m_ant_fgm.FGM_PROFILE_serial_num = FGM_SERIAL_NUMBER;
  m_ant_fgm.FGM_PROFILE_hw_version = FGM_HW_VERSION;
  m_ant_fgm.FGM_PROFILE_sw_version = FGM_SW_VERSION;
  m_ant_fgm.FGM_PROFILE_model_num  = FGM_MODEL_NUMBER;

  err_code = ant_fgm_sens_open(&m_ant_fgm);
  APP_ERROR_CHECK(err_code);

  err_code = ant_state_indicator_channel_opened();
  APP_ERROR_CHECK(err_code);
  NRF_LOG_PRINTF("ANT FGM Channel is now open (%X)\r\n", err_code);
/** @snippet [ANT FGM Profile Setup] */
#endif // ENABLE_ANT_FGM
}


/**@brief Power manager.
 */
static void power_manage(void)
{
    uint32_t err_code;

    // Wait for events
    err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}




#if (ENABLE_BATTERY_MEASURE == 1)
/**@brief Function for performing battery measurement and updating the Battery Level characteristic
 *        in Battery Service.
 */
static void battery_level_update(void)
{
  //battery_level = (uint8_t)sensorsim_measure(&m_battery_sim_state, &m_battery_sim_cfg);

  NRF_LOG_DEBUG("\r\n    Triggering battery level update...\r\n");
  app_sched_event_put(0,0,(app_sched_event_handler_t)adc_sample); //Put adc_sample function into the scheduler queue, which will then be executed in the main context (lowest priority) when app_sched_execute is called in the main loop
}


/**@brief Function for handling the Battery measurement timer timeout.
 *
 * @details This function will be called each time the battery level measurement timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void battery_level_meas_timeout_handler(void * p_context)
{
  UNUSED_PARAMETER(p_context);
  battery_level_update();
}


/** @brief Function for converting the input voltage (in milli volts) into percentage of 4.2 Volts.
 *         Based on battery_level_in_percent implementation in app_util.h
 *
 *  @details The calculation is based on a linearized version of the battery's discharge
 *           curve. 
 *           The Lithium battery typically has a voltage range of 2.7 - 4.2 V and we (Nordic) 
 *           recommend that you divide the battery voltage with two resistors, 
 *           R1 = 10 MOhm and R2 = 2.2 MOhm.
 *           voltage range on the ADC AIN input pin is:
 *            - Maximum voltage: 4.2 V * (2.2 M/(2.2 M+10 M)) = 0.757 V
 *            - Minimum voltage: 2.7 V * (2.2 M/(2.2 M+10 M)) = 0.487 V
 *            - ADC value at 4.2 V - 10 bit setup: 0.757 V/1.2*1023 = 646
 *            - ADC value at 2.7 V - 10 bit setup: 0.487 V/1.2*1023 = 415
 *            - Usable ADC resolution - 10 bit setup: 646-415 = 231
 *
 *           The discharge curve for LiPo battery is non-linear. In this model it is split into
 *           4 linear sections:
 *           - Section 1: 4.2V - 3.8V = 100% - 60% (40% drop on 400 mV)
 *           - Section 2: 3.8V - 3.7V = 60% - 35% (25% drop on 100 mV)
 *           - Section 3: 3.7V - 3.5V = 35% - 5% (30% drop on 200 mV)
 *           - Section 4: 3.5V - 2.7V = 5% - 0% (5% drop on 800 mV)
 *           
 *           based on 1C https://cdn-learn.adafruit.com/assets/assets/000/000/979/medium800/components_tenergydischarge.gif?1396767554
 *           These numbers are by no means accurate. Temperature and
 *           load in the actual application is not accounted for!
 *
 *  @param[in] mvolts The voltage in mV
 *
 *  @return    Battery level in percent.
*/
static __INLINE uint8_t lipo_level_in_percent(const uint16_t adc_result)
{
  uint8_t battery_level;
  const uint16_t mvolts = (uint16_t)((float)adc_result * 6.5f); // TODO: ADC_RESULT_IN_MILLI_VOLTS

  if (mvolts >= 4200)
  {
    battery_level = 100;
  }
  else if (mvolts > 3800)
  {
    battery_level = 100 - ((4200 - mvolts) * 40) / 400; // Section 1
  }
  else if (mvolts > 3700)
  {
    battery_level = 60 - ((3800 - mvolts) * 25) / 100; // Section 2
  }
  else if (mvolts > 2440)
  {
    battery_level = 35 - ((3700 - mvolts) * 30) / 200; // Section 3
  }
  else if (mvolts > 2700)
  {
    battery_level = 5 - ((3500 - mvolts) * 5) / 800; // Section 4
  }
  else
  {
    battery_level = 0;
  }

  return battery_level;
}


#if (ENABLE_BATTERY_MEASURE_SDK10 == 1)
bool adc_calibrate(uint16_t adc_result, uint16_t * adc_result_calibrated, uint8_t adc_resolution)
{
  uint32_t uicr_value;
  uint8_t offset_error;
  uint8_t gain_error;
  bool is_calibrated;

  // Apply ADC calibration described on 
  // https://devzone.nordicsemi.com/question/21653/how-to-calibrate-the-nrf51-adc-to-correct-offset-and-gain-error/
  uicr_value = *(uint32_t *)0x10000024; // Read ADC gain and offset error from UICR
  offset_error = uicr_value;
  gain_error = uicr_value >> 8;

  if(adc_resolution == ADC_CONFIG_RES_10bit)
  {
    *adc_result_calibrated = adc_result * (1024 + gain_error) / 1024 + offset_error; //calibrate
    is_calibrated = true;
  }
  else
  {
    // Calibration method not valid for given ADC resolution. Return adc value uncalibrated.
    *adc_result_calibrated = adc_result;      
    is_calibrated = false;
  }
  return is_calibrated;
}

/* Interrupt handler for ADC data ready event */
void ADC_IRQHandler(void)
{
  uint16_t adc_result_calibrated;
  uint8_t adc_result[2];

  /* Clear dataready event */
  NRF_ADC->EVENTS_END = 0;

  // Attempt to calibrate the ADC result
  adc_calibrate(NRF_ADC->RESULT, &adc_result_calibrated, ADC_RESOLUTION);

