DessertHunter/antFGM/Keil µVision5/nRF51422/Application/main.c
  NRF_LOG_PRINTF("ADC result: %X\r\n", adc_result_calibrated); // log ADC reult on UART

  adc_result[0] = adc_result_calibrated;
  adc_result[1] = adc_result_calibrated >> 8;

  NRF_LOG_PRINTF("ADC result: %X%X\r\n", adc_result[0], adc_result[1]); // log ADC reult on UART

  // Update measured ADC value as battery level
  m_battery_level_percent = lipo_level_in_percent(adc_result_calibrated);
  NRF_LOG_PRINTF("ADC result: %d => %d%%\r\n", adc_result_calibrated, m_battery_level_percent); // log ADC reult on UART
   
  
  // Release the external crystal
  sd_clock_hfclk_release();
}
#endif // ENABLE_BATTERY_MEASURE_SDK10

#if (ENABLE_BATTERY_MEASURE_SDK11 == 1)
/**
 * @brief ADC interrupt handler.
 */
static void adc_event_handler(nrf_drv_adc_evt_t const * p_event)
{
  uint32_t err_code;
  uint16_t adc_sum_value = 0;
  uint16_t adc_average_value;
  uint16_t adc_result_millivolts;
  uint8_t  adc_result_percent;

  sd_clock_hfclk_release(); // Release the external crystal

  adc_event_counter++;
  printf("    ADC event counter: %d\r\n", adc_event_counter);
  if (p_event->type == NRF_DRV_ADC_EVT_DONE)
  {
    uint32_t i;
    for (i = 0; i < p_event->data.done.size; i++)
    {
      printf("Sample value %d: %d\r\n", i+1, p_event->data.done.p_buffer[i]);
      adc_sum_value += p_event->data.done.p_buffer[i];                           //Sum all values in ADC buffer
    }
    adc_average_value = adc_sum_value / p_event->data.done.size;                   //Calculate average value from all samples in the ADC buffer
    printf("Average ADC value: %d\r\n", adc_average_value);

    adc_result_millivolts = ADC_RESULT_IN_MILLI_VOLTS(adc_average_value);          //Transform the average ADC value into millivolts value
    printf("ADC result in millivolts: %d\r\n", adc_result_millivolts);

    adc_result_percent = battery_level_in_percent(adc_result_millivolts);          //Transform the millivolts value into battery level percent.
    printf("ADC result in percent: %d\r\n", adc_result_percent);

#if (ENABLE_BLE_SRV_BAS == 1)
    //Send the battery level over BLE
    err_code = ble_bas_battery_level_update(&m_bas, adc_result_percent);           // Send the battery level over BLE
    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) && 
        (err_code != BLE_ERROR_NO_TX_PACKETS) && 
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING))
    {
      APP_ERROR_HANDLER(err_code); //Assert on error
    }
#endif // ENABLE_BLE_SRV_BAS
  }
}
#endif // ENABLE_BATTERY_MEASURE_SDK11

/**
 * @brief Configure and initialize the ADC
 */
static void adc_config(void)
{
#if (ENABLE_BATTERY_MEASURE_SDK10 == 1)
  /* Enable interrupt on ADC sample ready event*/
  NRF_ADC->INTENSET = ADC_INTENSET_END_Msk;   
  sd_nvic_SetPriority(ADC_IRQn, NRF_APP_PRIORITY_LOW);  
  sd_nvic_EnableIRQ(ADC_IRQn);

  NRF_ADC->CONFIG	= (ADC_CONFIG_EXTREFSEL_None << ADC_CONFIG_EXTREFSEL_Pos) /* Bits 17..16 : ADC external reference pin selection. */
                  | (ADC_CONFIG_PSEL_AnalogInput5 << ADC_CONFIG_PSEL_Pos)   /*!< Use analog input 2 as analog input. */
                  | (ADC_CONFIG_REFSEL_VBG << ADC_CONFIG_REFSEL_Pos)        /*!< Use internal 1.2V bandgap voltage as reference for conversion. */
                  | (ADC_CONFIG_INPSEL_AnalogInputOneThirdPrescaling << ADC_CONFIG_INPSEL_Pos) /*!< Analog input specified by PSEL with no prescaling used as input for the conversion. */
                  | (ADC_CONFIG_RES_8bit << ADC_CONFIG_RES_Pos);            /*!< 8bit ADC resolution. */ 

  /* Enable ADC*/
  NRF_ADC->ENABLE = ADC_ENABLE_ENABLE_Enabled;
#endif // ENABLE_BATTERY_MEASURE_SDK10

#if (ENABLE_BATTERY_MEASURE_SDK11 == 1)
  ret_code_t ret_code;
  nrf_drv_adc_config_t adc_config = NRF_DRV_ADC_DEFAULT_CONFIG;                                          // Get default ADC configuration
  static nrf_drv_adc_channel_t adc_channel_config = NRF_DRV_ADC_DEFAULT_CHANNEL(NRF_ADC_CONFIG_INPUT_2); // Get default ADC channel configuration

  //Uncomment the following two lines to sample the supply voltage of the nRF51 directly (not from a pin)
  //adc_channel_config.config.config.input = NRF_ADC_CONFIG_SCALING_SUPPLY_ONE_THIRD;
  //adc_channel_config.config.config.ain = NRF_ADC_CONFIG_INPUT_DISABLED;

  ret_code = nrf_drv_adc_init(&adc_config, adc_event_handler);              //Initialize the ADC
  APP_ERROR_CHECK(ret_code);

  nrf_drv_adc_channel_enable(&adc_channel_config);                          //Configure and enable an ADC channel
#endif // ENABLE_BATTERY_MEASURE_SDK11
}

/**
 * @brief Function to trigger ADC sampling
 */
void adc_sample(void)
{
#if (ENABLE_BATTERY_MEASURE_SDK10 == 1)
  uint32_t p_is_running = 0;
    
  // Start the HFCLK crystal for best ADC accuracy. It will increase current consumption.
  sd_clock_hfclk_request();
  while(! p_is_running) {
    //wait for the hfclk to be available
    sd_clock_hfclk_is_running((&p_is_running));
  }               
  NRF_ADC->TASKS_START = 1; //Start ADC sampling
#endif // ENABLE_BATTERY_MEASURE_SDK10
  
#if (ENABLE_BATTERY_MEASURE_SDK11 == 1)
  ret_code_t ret_code;
  uint32_t p_is_running = 0;

  ret_code = nrf_drv_adc_buffer_convert(adc_buffer, ADC_BUFFER_SIZE);       // Allocate buffer for ADC
  APP_ERROR_CHECK(ret_code);

  //Request the external high frequency crystal for best ADC accuracy. For lowest current consumption, don't request the crystal.
  sd_clock_hfclk_request();
  while(! p_is_running) {          //wait for the hfclk to be available
      sd_clock_hfclk_is_running((&p_is_running));
  }  

  for (uint32_t i = 0; i < ADC_BUFFER_SIZE; i++)
  {
      while((NRF_ADC->BUSY & ADC_BUSY_BUSY_Msk) == ADC_BUSY_BUSY_Busy) {}   //Wait until the ADC is finished sampling
      printf("Start sampling ... \r\n");
      nrf_drv_adc_sample();        // Trigger ADC conversion
  }
#endif // ENABLE_BATTERY_MEASURE_SDK11
}

#endif // ENABLE_BATTERY_MEASURE



/**@brief Application main function.
 */
int main(void)
{
  uint32_t err_code;

  NRF_LOG_DEBUG("\r\n***************************\r\n");
  NRF_LOG_DEBUG(DEVICE_NAME);
  NRF_LOG_DEBUG("\r\n***************************\r\n");

