DessertHunter/antFGM/Keil µVision5/nRF51422/Application/main.c
  // Initialize peripherals
  timers_init();

  // Initialize scheduler
  APP_SCHED_INIT(APP_SCHED_MAX_EVT_SIZE, APP_SCHED_QUEUE_SIZE);

  // Initialize S310 SoftDevice
  ble_ant_stack_init();

  err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS, APP_TIMER_TICKS(100, APP_TIMER_PRESCALER), NULL);
  APP_ERROR_CHECK(err_code);
  // err_code = bsp_buttons_enable((1 << WAKEUP_BUTTON_ID) | (1 << BOND_DELETE_ALL_BUTTON_ID));
  // APP_ERROR_CHECK(err_code);

  // Initialize Bluetooth stack parameters.
  ble_gap_params_init();
  ble_advertising_init();
  ble_services_init();

#if (ENABLE_BLE_SRV_HRS == 1)
  ble_hrm_conn_params_init();
#endif // ENABLE_BLE_SRV_HRS

#if (ENABLE_BLE_SRV_GLS == 1)
  ble_gls_conn_params_init();
#endif // ENABLE_BLE_SRV_GLS


  //utils_setup();
  softdevice_setup();

#if (ENABLE_ANT_FGM == 1)
  ant_state_indicator_init(m_ant_fgm.channel_number, FGM_SENS_CHANNEL_TYPE);
#endif // ENABLE_ANT_FGM

  profile_setup();


#ifdef BONDING_ENABLE
  uint32_t count;

  // Initialize device manager.
  device_manager_init();

  err_code = pstorage_access_status_get(&count);
  if ((err_code == NRF_SUCCESS) && (count == 0))
#endif // BONDING_ENABLE
  {
    ant_and_ble_adv_start();
  }

#if (CR95HF_IS_ATTACHED == 1)
  NRF_LOG_PRINTF("Init CR95HF!\r\n");
  UNUSED_VARIABLE(bsp_indication_set(CR95HF_BSP_USER_STATE));
  initCR95HF();
  wakeCR95HF(CR95HF_DEFAULT_TIMEOUT_MS); // wakeup if sleeping
  {
    CR95HF_IDN tChipIdentify;
    identifyCR95HF(&tChipIdentify, CR95HF_DEFAULT_TIMEOUT_MS);
    NRF_LOG_PRINTF("CR95HF identification '%s' (CRC=%X)\r\n", tChipIdentify.deviceID, tChipIdentify.romCRC);
  }
  UNUSED_VARIABLE(bsp_indication_set(BSP_INDICATE_USER_STATE_OFF));
#if (CR95HF_SLEEP_ENABLED == 1)
  NRF_LOG_PRINTF("CR95HF will sleep/hybernate\r\n");
#else
  NRF_LOG_PRINTF("CR95HF hypernate DEACTIVATED!\r\n");
#endif // CR95HF_SLEEP_ENABLED
#endif // CR95HF_IS_ATTACHED

#if (ENABLE_BATTERY_MEASURE == 1)
  adc_config(); // Initialize ADC
#endif // ENABLE_BATTERY_MEASURE

  // Start execution.
  application_timers_start();
  
  // Enter main loop.
  for (;;)
  {
    // Little TODO-List:
    // - CR95HF schlafen legen
    // - Fehler oder Error Rate? sozusagen ein Retry-Z�hler als Art Qualityidicator
    // - Fehler/Erfolgsverhältnis?
    // - Batteriestand
    // - Sensorrestlaufzeit bzw. Fehler wenn abgelaufen

#if (CR95HF_IS_ATTACHED == 1)
    UNUSED_VARIABLE(bsp_indication_set(CR95HF_BSP_USER_STATE));

    CR95HF_STATES nfc_state = getStateCR95HF();

#if (ENABLE_ANT_FGM == 1)
    // New state...
    m_ant_fgm.FGM_PROFILE_nfc_state = (uint8_t)nfc_state;
    
#if (ENABLE_BATTERY_MEASURE == 1)
    m_ant_fgm.FGM_PROFILE_battery_level = m_battery_level_percent;
#endif // ENABLE_BATTERY_MEASURE
          
#endif // ENABLE_ANT_FGM

    if (nfc_state == CR95HF_STATE_UNKNOWN)
    {
      // try startup sequence with reset ...
      resetCR95HF(); // send a reset command just in case the CR95HF hasn't been powered off

      nrf_delay_ms(100);
    }
    else if (nfc_state == CR95HF_STATE_SLEEPING)
    {
      // wake up CR95HF
      NRF_LOG_PRINTF("CR95HF wake up...\r\n");
      if (!wakeCR95HF(CR95HF_DEFAULT_TIMEOUT_MS)) // otherwise no communication possible
      {
        NRF_LOG_PRINTF("CR95HF state was SLEEPING, but wakeup failed!\r\n");
      }
    }
    else if (nfc_state == CR95HF_STATE_ANSWERING)
    {
      // NFC chip is answering
      // now set to protocol mode
      protocolISO15693_CR95HF(CR95HF_PROTOCOL_ISO_15693_WAIT_FOR_SOF
                              | CR95HF_PROTOCOL_ISO_15693_10_MODULATION
                              | CR95HF_PROTOCOL_ISO_15693_CRC); // ISO 15693 settings --> 0x0D = Wait for SOF, 10% modulation, append CRC
    }
    else if ((nfc_state == CR95HF_STATE_PROTOCOL) || (nfc_state == CR95HF_STATE_TAG_IN_RANGE))
    {
      // Tags can be read now... let's try:
      static CR95HF_TAG stKnownNfcTag;
      CR95HF_TAG tFoundNfcTag;
      bool fIsNewFoungTag = false;
      if (inventoryISO15693_CR95HF(&tFoundNfcTag, CR95HF_DEFAULT_TIMEOUT_MS)) // sensor in range?
      {
        // Yes, Sensor found!
        if (0 != memcmp(stKnownNfcTag.uid, tFoundNfcTag.uid, sizeof(tFoundNfcTag.uid)))
        {
          // is new / changed
          NRF_LOG_PRINTF("new sensor found: UID=%#02x:%#02x:%#02x:%#02x:%#02x:%#02x:%#02x:%#02x!\r\n",
                         tFoundNfcTag.uid[0], tFoundNfcTag.uid[1], tFoundNfcTag.uid[2], tFoundNfcTag.uid[3], tFoundNfcTag.uid[4], tFoundNfcTag.uid[5], tFoundNfcTag.uid[6], tFoundNfcTag.uid[7]);
          stKnownNfcTag = tFoundNfcTag;
          fIsNewFoungTag = true;

#if (ENABLE_ANT_FGM == 1)
          // we use last two tag-uid bytes for our serial number
          m_ant_fgm.FGM_PROFILE_serial_num = (tFoundNfcTag.uid[6] << 8) + tFoundNfcTag.uid[7];
#endif // ENABLE_ANT_FGM


#if (ENABLE_BLE_SRV_HRS == 1)
          // BLE HRS Service HRM update:
          const uint16_t glucose_value = tFoundNfcTag.uid[7]; // Letzte Stelle vom Sensor nehmen
          ble_hrs_update_heart_rate(glucose_value);
#endif // ENABLE_BLE_SRV_HRS

#if (ENABLE_BLE_SRV_GLS == 1)
          // TODO
#endif // ENABLE_BLE_SRV_GLS
        }

        bool fReadAllOk = true;
        uint8_t au8SensorRawData[LIBRE_SENSOR_RAW_DATA_LENGTH];
        for (uint8_t adr = LIBRE_SENSOR_RAW_DATA_START_BLOCK; adr <= LIBRE_SENSOR_RAW_DATA_END_BLOCK; adr++)
        {
          int len = readSingleCR95HF(adr, &au8SensorRawData[(adr - LIBRE_SENSOR_RAW_DATA_START_BLOCK) * LIBRE_SENSOR_RAW_DATA_BLOCK_SIZE], LIBRE_SENSOR_RAW_DATA_BLOCK_SIZE, CR95HF_DEFAULT_TIMEOUT_MS, CR95HF_READ_MAX_RETRY_CNT);
          if (LIBRE_SENSOR_RAW_DATA_BLOCK_SIZE != len)
          {
            // Error
            NRF_LOG_DEBUG("Error while reading sensor data!\r\n");
            fReadAllOk = false;
            break;
          }

          if (fIsNewFoungTag)
          {
            // DEBUG: print new Sensor data:
            NRF_LOG_PRINTF("block %#04d: %#02x %#02x %#02x %#02x %#02x %#02x %#02x %#02x\r\n", adr,
                           au8SensorRawData[(adr - LIBRE_SENSOR_RAW_DATA_START_BLOCK) * LIBRE_SENSOR_RAW_DATA_BLOCK_SIZE+0],
                           au8SensorRawData[(adr - LIBRE_SENSOR_RAW_DATA_START_BLOCK) * LIBRE_SENSOR_RAW_DATA_BLOCK_SIZE+1],
                           au8SensorRawData[(adr - LIBRE_SENSOR_RAW_DATA_START_BLOCK) * LIBRE_SENSOR_RAW_DATA_BLOCK_SIZE+2],
                           au8SensorRawData[(adr - LIBRE_SENSOR_RAW_DATA_START_BLOCK) * LIBRE_SENSOR_RAW_DATA_BLOCK_SIZE+3],
                           au8SensorRawData[(adr - LIBRE_SENSOR_RAW_DATA_START_BLOCK) * LIBRE_SENSOR_RAW_DATA_BLOCK_SIZE+4],
                           au8SensorRawData[(adr - LIBRE_SENSOR_RAW_DATA_START_BLOCK) * LIBRE_SENSOR_RAW_DATA_BLOCK_SIZE+5],
                           au8SensorRawData[(adr - LIBRE_SENSOR_RAW_DATA_START_BLOCK) * LIBRE_SENSOR_RAW_DATA_BLOCK_SIZE+6],
                           au8SensorRawData[(adr - LIBRE_SENSOR_RAW_DATA_START_BLOCK) * LIBRE_SENSOR_RAW_DATA_BLOCK_SIZE+7]);
          }
        }

        if (fReadAllOk)
        {
          // Ok, all nfc tag data read
          ST_LibreSensorData tSensorData;
          if (LibreSensor_ParseSensorData(tFoundNfcTag.uid, &au8SensorRawData[0], sizeof(au8SensorRawData), &tSensorData))
          {
            // Parsing ok
            if (fIsNewFoungTag)
            {
              NRF_LOG_PRINTF("sensor_id: '%s'\r\n", tSensorData.sensor_id);
            }

#if (CR95HF_SLEEP_ENABLED == 1)
            NRF_LOG_PRINTF("CR95HF will hybernate, gn8...\r\n");
            if (!hybernateCR95HF())
            {
              NRF_LOG_PRINTF("CR95HF hybernate failed!\r\n");
            }
#endif // CR95HF_SLEEP_ENABLED

#if (ENABLE_ANT_FGM == 1)
            // New measurement...
            m_ant_fgm.FGM_PROFILE_meas_glucose = tSensorData.current_glucose;
            m_ant_fgm.FGM_PROFILE_meas_time_offset++;
            m_ant_fgm.FGM_PROFILE_meas_prediction = tSensorData.trend_prediction;
            m_ant_fgm.FGM_PROFILE_meas_climb_sink_rate = tSensorData.glucose_climb_sink_rate;
            m_ant_fgm.FGM_PROFILE_meas_sequence_num++;
#endif // ENABLE_ANT_FGM
          }
        }

      }
    }
    else // illegal nfc_state
    {
      NRF_LOG_PRINTF("Error illegal nfc_state=%d, try reset!\r\n", nfc_state);

      // try startup sequence with reset ...
      resetCR95HF();
      nrf_delay_ms(5000);
    }
    UNUSED_VARIABLE(bsp_indication_set(BSP_INDICATE_USER_STATE_OFF));
#endif // CR95HF_IS_ATTACHED

    NRF_LOG_DEBUG(".");

    for (int i = 1; i < 10; i++)
    {
      UNUSED_VARIABLE(bsp_indication_set(BSP_INDICATE_USER_STATE_0));
      nrf_delay_ms(5);
      UNUSED_VARIABLE(bsp_indication_set(BSP_INDICATE_USER_STATE_OFF));
      nrf_delay_ms(1000);
      
      power_manage();
      app_sched_execute(); // Let scheduler execute whatever is in the scheduler queue
    }
  }
}

/**
 * @}
 */
